In [1]:
import pandas as pd
import math

In [2]:
data={'Name':['Karan','Rohit','Sahil','Aryan'],'Age':[23,22,21,24]}
df=pd.DataFrame(data)

In [3]:
data2={'Name':['waffles','pancakes','holly','mama'],'Age':[32,32,31,34]}
df2=pd.DataFrame(data2)

In [4]:
df

    Name  Age
0  Karan   23
1  Rohit   22
2  Sahil   21
3  Aryan   24

In [5]:
df2

       Name  Age
0   waffles   32
1  pancakes   32
2     holly   31
3      mama   34

In [6]:
df = pd.concat([df, df2], ignore_index=True, join = inner axis = 1)
df

       Name  Age
0     Karan   23
1     Rohit   22
2     Sahil   21
3     Aryan   24
4   waffles   32
5  pancakes   32
6     holly   31
7      mama   34